Revit 2024 API
EnergyDataSettings.CreateAnalyticalModel Property
 If this is true, data, features, and geometry related to the Energy Analytical Model will be created, allowing the energy performance to be analyzed through GreenBuilidingXML.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public bool CreateAnalyticalModel { get; }
Visual Basic
Public ReadOnly Property CreateAnalyticalModel As Boolean
	Get
Visual C++
public:
property bool CreateAnalyticalModel {
	bool get ();
}
See Also
EnergyDataSettings Class
Autodesk.Revit.DB.Analysis Namespace